products/wso2_GW/product_features/message_routing/message_routing_scenarios/GW-6/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://www.wso2.org/types">
   <soapenv:Header/>
     <soapenv:Body>
      <typ:greet> 
         <name>TestUser</name>
      </typ:greet>
   </soapenv:Body>
</soapenv:Envelope>
